loadtest-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 5m30s max duration (incl. graceful stop):
              * ramp_up: Up to 50 looping VUs for 5m0s over 1 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
ramp_up   [   0% ] 01/50 VUs  0m01.0s/5m00.0s

running (0m02.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
ramp_up   [   1% ] 01/50 VUs  0m02.0s/5m00.0s

running (0m03.0s), 01/50 VUs, 1 complete and 0 interrupted iterations
ramp_up   [   1% ] 01/50 VUs  0m03.0s/5m00.0s

running (0m04.0s), 01/50 VUs, 1 complete and 0 interrupted iterations
ramp_up   [   1% ] 01/50 VUs  0m04.0s/5m00.0s

running (0m05.0s), 01/50 VUs, 2 complete and 0 interrupted iterations
ramp_up   [   2% ] 01/50 VUs  0m05.0s/5m00.0s

running (0m06.0s), 01/50 VUs, 2 complete and 0 interrupted iterations
ramp_up   [   2% ] 01/50 VUs  0m06.0s/5m00.0s

running (0m07.0s), 02/50 VUs, 2 complete and 0 interrupted iterations
ramp_up   [   2% ] 02/50 VUs  0m07.0s/5m00.0s

running (0m08.0s), 02/50 VUs, 3 complete and 0 interrupted iterations
ramp_up   [   3% ] 02/50 VUs  0m08.0s/5m00.0s

running (0m09.0s), 02/50 VUs, 4 complete and 0 interrupted iterations
ramp_up   [   3% ] 02/50 VUs  0m09.0s/5m00.0s

running (0m10.0s), 02/50 VUs, 5 complete and 0 interrupted iterations
ramp_up   [   3% ] 02/50 VUs  0m10.0s/5m00.0s

running (0m11.0s), 02/50 VUs, 5 complete and 0 interrupted iterations
ramp_up   [   4% ] 02/50 VUs  0m11.0s/5m00.0s

running (0m12.0s), 02/50 VUs, 6 complete and 0 interrupted iterations
ramp_up   [   4% ] 02/50 VUs  0m12.0s/5m00.0s

running (0m13.0s), 03/50 VUs, 7 complete and 0 interrupted iterations
ramp_up   [   4% ] 03/50 VUs  0m13.0s/5m00.0s

running (0m14.0s), 03/50 VUs, 8 complete and 0 interrupted iterations
ramp_up   [   5% ] 03/50 VUs  0m14.0s/5m00.0s

running (0m15.0s), 03/50 VUs, 8 complete and 0 interrupted iterations
ramp_up   [   5% ] 03/50 VUs  0m15.0s/5m00.0s

running (0m16.0s), 03/50 VUs, 8 complete and 0 interrupted iterations
ramp_up   [   5% ] 03/50 VUs  0m16.0s/5m00.0s

running (0m17.0s), 03/50 VUs, 9 complete and 0 interrupted iterations
ramp_up   [   6% ] 03/50 VUs  0m17.0s/5m00.0s

running (0m18.0s), 03/50 VUs, 10 complete and 0 interrupted iterations
ramp_up   [   6% ] 03/50 VUs  0m18.0s/5m00.0s

running (0m19.0s), 04/50 VUs, 11 complete and 0 interrupted iterations
ramp_up   [   6% ] 04/50 VUs  0m19.0s/5m00.0s

running (0m20.0s), 04/50 VUs, 11 complete and 0 interrupted iterations
ramp_up   [   7% ] 04/50 VUs  0m20.0s/5m00.0s

running (0m21.0s), 04/50 VUs, 12 complete and 0 interrupted iterations
ramp_up   [   7% ] 04/50 VUs  0m21.0s/5m00.0s

running (0m22.0s), 04/50 VUs, 12 complete and 0 interrupted iterations
ramp_up   [   7% ] 04/50 VUs  0m22.0s/5m00.0s

running (0m23.0s), 04/50 VUs, 12 complete and 0 interrupted iterations
ramp_up   [   8% ] 04/50 VUs  0m23.0s/5m00.0s

running (0m24.0s), 04/50 VUs, 14 complete and 0 interrupted iterations
ramp_up   [   8% ] 04/50 VUs  0m24.0s/5m00.0s

running (0m25.0s), 05/50 VUs, 15 complete and 0 interrupted iterations
ramp_up   [   8% ] 05/50 VUs  0m25.0s/5m00.0s

running (0m26.0s), 05/50 VUs, 15 complete and 0 interrupted iterations
ramp_up   [   9% ] 05/50 VUs  0m26.0s/5m00.0s

running (0m27.0s), 05/50 VUs, 16 complete and 0 interrupted iterations
ramp_up   [   9% ] 05/50 VUs  0m27.0s/5m00.0s

running (0m28.0s), 05/50 VUs, 16 complete and 0 interrupted iterations
ramp_up   [   9% ] 05/50 VUs  0m28.0s/5m00.0s

running (0m29.0s), 05/50 VUs, 16 complete and 0 interrupted iterations
ramp_up   [  10% ] 05/50 VUs  0m29.0s/5m00.0s

running (0m30.0s), 05/50 VUs, 17 complete and 0 interrupted iterations
ramp_up   [  10% ] 05/50 VUs  0m30.0s/5m00.0s

running (0m31.0s), 06/50 VUs, 17 complete and 0 interrupted iterations
ramp_up   [  10% ] 06/50 VUs  0m31.0s/5m00.0s

running (0m32.0s), 06/50 VUs, 18 complete and 0 interrupted iterations
ramp_up   [  11% ] 06/50 VUs  0m32.0s/5m00.0s

running (0m33.0s), 06/50 VUs, 20 complete and 0 interrupted iterations
ramp_up   [  11% ] 06/50 VUs  0m33.0s/5m00.0s

running (0m34.0s), 06/50 VUs, 21 complete and 0 interrupted iterations
ramp_up   [  11% ] 06/50 VUs  0m34.0s/5m00.0s

running (0m35.0s), 06/50 VUs, 21 complete and 0 interrupted iterations
ramp_up   [  12% ] 06/50 VUs  0m35.0s/5m00.0s

running (0m36.0s), 06/50 VUs, 21 complete and 0 interrupted iterations
ramp_up   [  12% ] 06/50 VUs  0m36.0s/5m00.0s

running (0m37.0s), 07/50 VUs, 21 complete and 0 interrupted iterations
ramp_up   [  12% ] 07/50 VUs  0m37.0s/5m00.0s

running (0m38.0s), 07/50 VUs, 21 complete and 0 interrupted iterations
ramp_up   [  13% ] 07/50 VUs  0m38.0s/5m00.0s

running (0m39.0s), 07/50 VUs, 22 complete and 0 interrupted iterations
ramp_up   [  13% ] 07/50 VUs  0m39.0s/5m00.0s

running (0m40.0s), 07/50 VUs, 23 complete and 0 interrupted iterations
ramp_up   [  13% ] 07/50 VUs  0m40.0s/5m00.0s

running (0m41.0s), 07/50 VUs, 24 complete and 0 interrupted iterations
ramp_up   [  14% ] 07/50 VUs  0m41.0s/5m00.0s

running (0m42.0s), 07/50 VUs, 26 complete and 0 interrupted iterations
ramp_up   [  14% ] 07/50 VUs  0m42.0s/5m00.0s

running (0m43.0s), 08/50 VUs, 26 complete and 0 interrupted iterations
ramp_up   [  14% ] 08/50 VUs  0m43.0s/5m00.0s

running (0m44.0s), 08/50 VUs, 27 complete and 0 interrupted iterations
ramp_up   [  15% ] 08/50 VUs  0m44.0s/5m00.0s

running (0m45.0s), 08/50 VUs, 27 complete and 0 interrupted iterations
ramp_up   [  15% ] 08/50 VUs  0m45.0s/5m00.0s

running (0m46.0s), 08/50 VUs, 27 complete and 0 interrupted iterations
ramp_up   [  15% ] 08/50 VUs  0m46.0s/5m00.0s

running (0m47.0s), 08/50 VUs, 27 complete and 0 interrupted iterations
ramp_up   [  16% ] 08/50 VUs  0m47.0s/5m00.0s

running (0m48.0s), 08/50 VUs, 28 complete and 0 interrupted iterations
ramp_up   [  16% ] 08/50 VUs  0m48.0s/5m00.0s

running (0m49.0s), 08/50 VUs, 28 complete and 0 interrupted iterations
ramp_up   [  16% ] 08/50 VUs  0m49.0s/5m00.0s

running (0m50.0s), 09/50 VUs, 29 complete and 0 interrupted iterations
ramp_up   [  17% ] 09/50 VUs  0m50.0s/5m00.0s

running (0m51.0s), 09/50 VUs, 30 complete and 0 interrupted iterations
ramp_up   [  17% ] 09/50 VUs  0m51.0s/5m00.0s

running (0m52.0s), 09/50 VUs, 31 complete and 0 interrupted iterations
ramp_up   [  17% ] 09/50 VUs  0m52.0s/5m00.0s

running (0m53.0s), 09/50 VUs, 32 complete and 0 interrupted iterations
ramp_up   [  18% ] 09/50 VUs  0m53.0s/5m00.0s

running (0m54.0s), 09/50 VUs, 33 complete and 0 interrupted iterations
ramp_up   [  18% ] 09/50 VUs  0m54.0s/5m00.0s

running (0m55.0s), 09/50 VUs, 34 complete and 0 interrupted iterations
ramp_up   [  18% ] 09/50 VUs  0m55.0s/5m00.0s

running (0m56.0s), 10/50 VUs, 35 complete and 0 interrupted iterations
ramp_up   [  19% ] 10/50 VUs  0m56.0s/5m00.0s

running (0m57.0s), 10/50 VUs, 35 complete and 0 interrupted iterations
ramp_up   [  19% ] 10/50 VUs  0m57.0s/5m00.0s

running (0m58.0s), 10/50 VUs, 35 complete and 0 interrupted iterations
ramp_up   [  19% ] 10/50 VUs  0m58.0s/5m00.0s

running (0m59.0s), 10/50 VUs, 35 complete and 0 interrupted iterations
ramp_up   [  20% ] 10/50 VUs  0m59.0s/5m00.0s

running (1m00.0s), 10/50 VUs, 35 complete and 0 interrupted iterations
ramp_up   [  20% ] 10/50 VUs  1m00.0s/5m00.0s

running (1m01.0s), 10/50 VUs, 36 complete and 0 interrupted iterations
ramp_up   [  20% ] 10/50 VUs  1m01.0s/5m00.0s

running (1m02.0s), 11/50 VUs, 37 complete and 0 interrupted iterations
ramp_up   [  21% ] 11/50 VUs  1m02.0s/5m00.0s

running (1m03.0s), 11/50 VUs, 37 complete and 0 interrupted iterations
ramp_up   [  21% ] 11/50 VUs  1m03.0s/5m00.0s

running (1m04.0s), 11/50 VUs, 37 complete and 0 interrupted iterations
ramp_up   [  21% ] 11/50 VUs  1m04.0s/5m00.0s

running (1m05.0s), 11/50 VUs, 38 complete and 0 interrupted iterations
ramp_up   [  22% ] 11/50 VUs  1m05.0s/5m00.0s

running (1m06.0s), 11/50 VUs, 40 complete and 0 interrupted iterations
ramp_up   [  22% ] 11/50 VUs  1m06.0s/5m00.0s

running (1m07.0s), 11/50 VUs, 41 complete and 0 interrupted iterations
ramp_up   [  22% ] 11/50 VUs  1m07.0s/5m00.0s

running (1m08.0s), 12/50 VUs, 42 complete and 0 interrupted iterations
ramp_up   [  23% ] 12/50 VUs  1m08.0s/5m00.0s

running (1m09.0s), 12/50 VUs, 43 complete and 0 interrupted iterations
ramp_up   [  23% ] 12/50 VUs  1m09.0s/5m00.0s

running (1m10.0s), 12/50 VUs, 43 complete and 0 interrupted iterations
ramp_up   [  23% ] 12/50 VUs  1m10.0s/5m00.0s

running (1m11.0s), 12/50 VUs, 43 complete and 0 interrupted iterations
ramp_up   [  24% ] 12/50 VUs  1m11.0s/5m00.0s

running (1m12.0s), 12/50 VUs, 44 complete and 0 interrupted iterations
ramp_up   [  24% ] 12/50 VUs  1m12.0s/5m00.0s

running (1m13.0s), 12/50 VUs, 45 complete and 0 interrupted iterations
ramp_up   [  24% ] 12/50 VUs  1m13.0s/5m00.0s

running (1m14.0s), 13/50 VUs, 45 complete and 0 interrupted iterations
ramp_up   [  25% ] 13/50 VUs  1m14.0s/5m00.0s

running (1m15.0s), 13/50 VUs, 46 complete and 0 interrupted iterations
ramp_up   [  25% ] 13/50 VUs  1m15.0s/5m00.0s

running (1m16.0s), 13/50 VUs, 46 complete and 0 interrupted iterations
ramp_up   [  25% ] 13/50 VUs  1m16.0s/5m00.0s

running (1m17.0s), 13/50 VUs, 46 complete and 0 interrupted iterations
ramp_up   [  26% ] 13/50 VUs  1m17.0s/5m00.0s

running (1m18.0s), 13/50 VUs, 46 complete and 0 interrupted iterations
ramp_up   [  26% ] 13/50 VUs  1m18.0s/5m00.0s

running (1m19.0s), 13/50 VUs, 47 complete and 0 interrupted iterations
ramp_up   [  26% ] 13/50 VUs  1m19.0s/5m00.0s

running (1m20.0s), 14/50 VUs, 48 complete and 0 interrupted iterations
ramp_up   [  27% ] 14/50 VUs  1m20.0s/5m00.0s

running (1m21.0s), 14/50 VUs, 49 complete and 0 interrupted iterations
ramp_up   [  27% ] 14/50 VUs  1m21.0s/5m00.0s

running (1m22.0s), 14/50 VUs, 49 complete and 0 interrupted iterations
ramp_up   [  27% ] 14/50 VUs  1m22.0s/5m00.0s

running (1m23.0s), 14/50 VUs, 50 complete and 0 interrupted iterations
ramp_up   [  28% ] 14/50 VUs  1m23.0s/5m00.0s

running (1m24.0s), 14/50 VUs, 51 complete and 0 interrupted iterations
ramp_up   [  28% ] 14/50 VUs  1m24.0s/5m00.0s

running (1m25.0s), 14/50 VUs, 52 complete and 0 interrupted iterations
ramp_up   [  28% ] 14/50 VUs  1m25.0s/5m00.0s

running (1m26.0s), 15/50 VUs, 53 complete and 0 interrupted iterations
ramp_up   [  29% ] 15/50 VUs  1m26.0s/5m00.0s

running (1m27.0s), 15/50 VUs, 53 complete and 0 interrupted iterations
ramp_up   [  29% ] 15/50 VUs  1m27.0s/5m00.0s

running (1m28.0s), 15/50 VUs, 55 complete and 0 interrupted iterations
ramp_up   [  29% ] 15/50 VUs  1m28.0s/5m00.0s

running (1m29.0s), 15/50 VUs, 55 complete and 0 interrupted iterations
ramp_up   [  30% ] 15/50 VUs  1m29.0s/5m00.0s

running (1m30.0s), 15/50 VUs, 56 complete and 0 interrupted iterations
ramp_up   [  30% ] 15/50 VUs  1m30.0s/5m00.0s

running (1m31.0s), 15/50 VUs, 56 complete and 0 interrupted iterations
ramp_up   [  30% ] 15/50 VUs  1m31.0s/5m00.0s

running (1m32.0s), 16/50 VUs, 57 complete and 0 interrupted iterations
ramp_up   [  31% ] 16/50 VUs  1m32.0s/5m00.0s

running (1m33.0s), 16/50 VUs, 57 complete and 0 interrupted iterations
ramp_up   [  31% ] 16/50 VUs  1m33.0s/5m00.0s

running (1m34.0s), 16/50 VUs, 58 complete and 0 interrupted iterations
ramp_up   [  31% ] 16/50 VUs  1m34.0s/5m00.0s

running (1m35.0s), 16/50 VUs, 58 complete and 0 interrupted iterations
ramp_up   [  32% ] 16/50 VUs  1m35.0s/5m00.0s

running (1m36.0s), 16/50 VUs, 59 complete and 0 interrupted iterations
ramp_up   [  32% ] 16/50 VUs  1m36.0s/5m00.0s

running (1m37.0s), 16/50 VUs, 59 complete and 0 interrupted iterations
ramp_up   [  32% ] 16/50 VUs  1m37.0s/5m00.0s

running (1m38.0s), 17/50 VUs, 59 complete and 0 interrupted iterations
ramp_up   [  33% ] 17/50 VUs  1m38.0s/5m00.0s

running (1m39.0s), 17/50 VUs, 60 complete and 0 interrupted iterations
ramp_up   [  33% ] 17/50 VUs  1m39.0s/5m00.0s

running (1m40.0s), 17/50 VUs, 61 complete and 0 interrupted iterations
ramp_up   [  33% ] 17/50 VUs  1m40.0s/5m00.0s

running (1m41.0s), 17/50 VUs, 61 complete and 0 interrupted iterations
ramp_up   [  34% ] 17/50 VUs  1m41.0s/5m00.0s

running (1m42.0s), 17/50 VUs, 62 complete and 0 interrupted iterations
ramp_up   [  34% ] 17/50 VUs  1m42.0s/5m00.0s

running (1m43.0s), 17/50 VUs, 63 complete and 0 interrupted iterations
ramp_up   [  34% ] 17/50 VUs  1m43.0s/5m00.0s

running (1m44.0s), 17/50 VUs, 64 complete and 0 interrupted iterations
ramp_up   [  35% ] 17/50 VUs  1m44.0s/5m00.0s

running (1m45.0s), 18/50 VUs, 64 complete and 0 interrupted iterations
ramp_up   [  35% ] 18/50 VUs  1m45.0s/5m00.0s

running (1m46.0s), 18/50 VUs, 65 complete and 0 interrupted iterations
ramp_up   [  35% ] 18/50 VUs  1m46.0s/5m00.0s

running (1m47.0s), 18/50 VUs, 65 complete and 0 interrupted iterations
ramp_up   [  36% ] 18/50 VUs  1m47.0s/5m00.0s

running (1m48.0s), 18/50 VUs, 66 complete and 0 interrupted iterations
ramp_up   [  36% ] 18/50 VUs  1m48.0s/5m00.0s

running (1m49.0s), 18/50 VUs, 67 complete and 0 interrupted iterations
ramp_up   [  36% ] 18/50 VUs  1m49.0s/5m00.0s

running (1m50.0s), 18/50 VUs, 69 complete and 0 interrupted iterations
ramp_up   [  37% ] 18/50 VUs  1m50.0s/5m00.0s

running (1m51.0s), 19/50 VUs, 69 complete and 0 interrupted iterations
ramp_up   [  37% ] 19/50 VUs  1m51.0s/5m00.0s

running (1m52.0s), 19/50 VUs, 69 complete and 0 interrupted iterations
ramp_up   [  37% ] 19/50 VUs  1m52.0s/5m00.0s

running (1m53.0s), 19/50 VUs, 70 complete and 0 interrupted iterations
ramp_up   [  38% ] 19/50 VUs  1m53.0s/5m00.0s

running (1m54.0s), 19/50 VUs, 70 complete and 0 interrupted iterations
ramp_up   [  38% ] 19/50 VUs  1m54.0s/5m00.0s

running (1m55.0s), 19/50 VUs, 71 complete and 0 interrupted iterations
ramp_up   [  38% ] 19/50 VUs  1m55.0s/5m00.0s

running (1m56.0s), 19/50 VUs, 72 complete and 0 interrupted iterations
ramp_up   [  39% ] 19/50 VUs  1m56.0s/5m00.0s

running (1m57.0s), 20/50 VUs, 73 complete and 0 interrupted iterations
ramp_up   [  39% ] 20/50 VUs  1m57.0s/5m00.0s

running (1m58.0s), 20/50 VUs, 73 complete and 0 interrupted iterations
ramp_up   [  39% ] 20/50 VUs  1m58.0s/5m00.0s

running (1m59.0s), 20/50 VUs, 73 complete and 0 interrupted iterations
ramp_up   [  40% ] 20/50 VUs  1m59.0s/5m00.0s

running (2m00.0s), 20/50 VUs, 74 complete and 0 interrupted iterations
ramp_up   [  40% ] 20/50 VUs  2m00.0s/5m00.0s

running (2m01.0s), 20/50 VUs, 74 complete and 0 interrupted iterations
ramp_up   [  40% ] 20/50 VUs  2m01.0s/5m00.0s

running (2m02.0s), 20/50 VUs, 75 complete and 0 interrupted iterations
ramp_up   [  41% ] 20/50 VUs  2m02.0s/5m00.0s

running (2m03.0s), 21/50 VUs, 75 complete and 0 interrupted iterations
ramp_up   [  41% ] 21/50 VUs  2m03.0s/5m00.0s

running (2m04.0s), 21/50 VUs, 75 complete and 0 interrupted iterations
ramp_up   [  41% ] 21/50 VUs  2m04.0s/5m00.0s

running (2m05.0s), 21/50 VUs, 76 complete and 0 interrupted iterations
ramp_up   [  42% ] 21/50 VUs  2m05.0s/5m00.0s

running (2m06.0s), 21/50 VUs, 77 complete and 0 interrupted iterations
ramp_up   [  42% ] 21/50 VUs  2m06.0s/5m00.0s

running (2m07.0s), 21/50 VUs, 78 complete and 0 interrupted iterations
ramp_up   [  42% ] 21/50 VUs  2m07.0s/5m00.0s

running (2m08.0s), 21/50 VUs, 78 complete and 0 interrupted iterations
ramp_up   [  43% ] 21/50 VUs  2m08.0s/5m00.0s

running (2m09.0s), 22/50 VUs, 79 complete and 0 interrupted iterations
ramp_up   [  43% ] 22/50 VUs  2m09.0s/5m00.0s

running (2m10.0s), 22/50 VUs, 80 complete and 0 interrupted iterations
ramp_up   [  43% ] 22/50 VUs  2m10.0s/5m00.0s

running (2m11.0s), 22/50 VUs, 80 complete and 0 interrupted iterations
ramp_up   [  44% ] 22/50 VUs  2m11.0s/5m00.0s

running (2m12.0s), 22/50 VUs, 80 complete and 0 interrupted iterations
ramp_up   [  44% ] 22/50 VUs  2m12.0s/5m00.0s

running (2m13.0s), 22/50 VUs, 81 complete and 0 interrupted iterations
ramp_up   [  44% ] 22/50 VUs  2m13.0s/5m00.0s

running (2m14.0s), 22/50 VUs, 81 complete and 0 interrupted iterations
ramp_up   [  45% ] 22/50 VUs  2m14.0s/5m00.0s

running (2m15.0s), 23/50 VUs, 83 complete and 0 interrupted iterations
ramp_up   [  45% ] 23/50 VUs  2m15.0s/5m00.0s

running (2m16.0s), 23/50 VUs, 84 complete and 0 interrupted iterations
ramp_up   [  45% ] 23/50 VUs  2m16.0s/5m00.0s

running (2m17.0s), 23/50 VUs, 85 complete and 0 interrupted iterations
ramp_up   [  46% ] 23/50 VUs  2m17.0s/5m00.0s

running (2m18.0s), 23/50 VUs, 85 complete and 0 interrupted iterations
ramp_up   [  46% ] 23/50 VUs  2m18.0s/5m00.0s

running (2m19.0s), 23/50 VUs, 86 complete and 0 interrupted iterations
ramp_up   [  46% ] 23/50 VUs  2m19.0s/5m00.0s

running (2m20.0s), 23/50 VUs, 87 complete and 0 interrupted iterations
ramp_up   [  47% ] 23/50 VUs  2m20.0s/5m00.0s

running (2m21.0s), 24/50 VUs, 87 complete and 0 interrupted iterations
ramp_up   [  47% ] 24/50 VUs  2m21.0s/5m00.0s

running (2m22.0s), 24/50 VUs, 88 complete and 0 interrupted iterations
ramp_up   [  47% ] 24/50 VUs  2m22.0s/5m00.0s

running (2m23.0s), 24/50 VUs, 89 complete and 0 interrupted iterations
ramp_up   [  48% ] 24/50 VUs  2m23.0s/5m00.0s

running (2m24.0s), 24/50 VUs, 89 complete and 0 interrupted iterations
ramp_up   [  48% ] 24/50 VUs  2m24.0s/5m00.0s

running (2m25.0s), 24/50 VUs, 90 complete and 0 interrupted iterations
ramp_up   [  48% ] 24/50 VUs  2m25.0s/5m00.0s

running (2m26.0s), 24/50 VUs, 90 complete and 0 interrupted iterations
ramp_up   [  49% ] 24/50 VUs  2m26.0s/5m00.0s

running (2m27.0s), 25/50 VUs, 91 complete and 0 interrupted iterations
ramp_up   [  49% ] 25/50 VUs  2m27.0s/5m00.0s

running (2m28.0s), 25/50 VUs, 92 complete and 0 interrupted iterations
ramp_up   [  49% ] 25/50 VUs  2m28.0s/5m00.0s

running (2m29.0s), 25/50 VUs, 93 complete and 0 interrupted iterations
ramp_up   [  50% ] 25/50 VUs  2m29.0s/5m00.0s

running (2m30.0s), 25/50 VUs, 93 complete and 0 interrupted iterations
ramp_up   [  50% ] 25/50 VUs  2m30.0s/5m00.0s

running (2m31.0s), 25/50 VUs, 93 complete and 0 interrupted iterations
ramp_up   [  50% ] 25/50 VUs  2m31.0s/5m00.0s

running (2m32.0s), 25/50 VUs, 94 complete and 0 interrupted iterations
ramp_up   [  51% ] 25/50 VUs  2m32.0s/5m00.0s

running (2m33.0s), 25/50 VUs, 94 complete and 0 interrupted iterations
ramp_up   [  51% ] 25/50 VUs  2m33.0s/5m00.0s

running (2m34.0s), 26/50 VUs, 95 complete and 0 interrupted iterations
ramp_up   [  51% ] 26/50 VUs  2m34.0s/5m00.0s

running (2m35.0s), 26/50 VUs, 96 complete and 0 interrupted iterations
ramp_up   [  52% ] 26/50 VUs  2m35.0s/5m00.0s

running (2m36.0s), 26/50 VUs, 96 complete and 0 interrupted iterations
ramp_up   [  52% ] 26/50 VUs  2m36.0s/5m00.0s

running (2m37.0s), 26/50 VUs, 97 complete and 0 interrupted iterations
ramp_up   [  52% ] 26/50 VUs  2m37.0s/5m00.0s

running (2m38.0s), 26/50 VUs, 97 complete and 0 interrupted iterations
ramp_up   [  53% ] 26/50 VUs  2m38.0s/5m00.0s

running (2m39.0s), 26/50 VUs, 98 complete and 0 interrupted iterations
ramp_up   [  53% ] 26/50 VUs  2m39.0s/5m00.0s

running (2m40.0s), 27/50 VUs, 98 complete and 0 interrupted iterations
ramp_up   [  53% ] 27/50 VUs  2m40.0s/5m00.0s

running (2m41.0s), 27/50 VUs, 99 complete and 0 interrupted iterations
ramp_up   [  54% ] 27/50 VUs  2m41.0s/5m00.0s

running (2m42.0s), 27/50 VUs, 100 complete and 0 interrupted iterations
ramp_up   [  54% ] 27/50 VUs  2m42.0s/5m00.0s

running (2m43.0s), 27/50 VUs, 101 complete and 0 interrupted iterations
ramp_up   [  54% ] 27/50 VUs  2m43.0s/5m00.0s

running (2m44.0s), 27/50 VUs, 102 complete and 0 interrupted iterations
ramp_up   [  55% ] 27/50 VUs  2m44.0s/5m00.0s

running (2m45.0s), 27/50 VUs, 102 complete and 0 interrupted iterations
ramp_up   [  55% ] 27/50 VUs  2m45.0s/5m00.0s

running (2m46.0s), 28/50 VUs, 102 complete and 0 interrupted iterations
ramp_up   [  55% ] 28/50 VUs  2m46.0s/5m00.0s

running (2m47.0s), 28/50 VUs, 103 complete and 0 interrupted iterations
ramp_up   [  56% ] 28/50 VUs  2m47.0s/5m00.0s

running (2m48.0s), 28/50 VUs, 103 complete and 0 interrupted iterations
ramp_up   [  56% ] 28/50 VUs  2m48.0s/5m00.0s

running (2m49.0s), 28/50 VUs, 104 complete and 0 interrupted iterations
ramp_up   [  56% ] 28/50 VUs  2m49.0s/5m00.0s

running (2m50.0s), 28/50 VUs, 106 complete and 0 interrupted iterations
ramp_up   [  57% ] 28/50 VUs  2m50.0s/5m00.0s

running (2m51.0s), 28/50 VUs, 107 complete and 0 interrupted iterations
ramp_up   [  57% ] 28/50 VUs  2m51.0s/5m00.0s

running (2m52.0s), 29/50 VUs, 107 complete and 0 interrupted iterations
ramp_up   [  57% ] 29/50 VUs  2m52.0s/5m00.0s

running (2m53.0s), 29/50 VUs, 107 complete and 0 interrupted iterations
ramp_up   [  58% ] 29/50 VUs  2m53.0s/5m00.0s

running (2m54.0s), 29/50 VUs, 108 complete and 0 interrupted iterations
ramp_up   [  58% ] 29/50 VUs  2m54.0s/5m00.0s

running (2m55.0s), 29/50 VUs, 109 complete and 0 interrupted iterations
ramp_up   [  58% ] 29/50 VUs  2m55.0s/5m00.0s

running (2m56.0s), 29/50 VUs, 110 complete and 0 interrupted iterations
ramp_up   [  59% ] 29/50 VUs  2m56.0s/5m00.0s

running (2m57.0s), 29/50 VUs, 110 complete and 0 interrupted iterations
ramp_up   [  59% ] 29/50 VUs  2m57.0s/5m00.0s

running (2m58.0s), 30/50 VUs, 111 complete and 0 interrupted iterations
ramp_up   [  59% ] 30/50 VUs  2m58.0s/5m00.0s

running (2m59.0s), 30/50 VUs, 112 complete and 0 interrupted iterations
ramp_up   [  60% ] 30/50 VUs  2m59.0s/5m00.0s

running (3m00.0s), 30/50 VUs, 112 complete and 0 interrupted iterations
ramp_up   [  60% ] 30/50 VUs  3m00.0s/5m00.0s

running (3m01.0s), 30/50 VUs, 113 complete and 0 interrupted iterations
ramp_up   [  60% ] 30/50 VUs  3m01.0s/5m00.0s

running (3m02.0s), 30/50 VUs, 113 complete and 0 interrupted iterations
ramp_up   [  61% ] 30/50 VUs  3m02.0s/5m00.0s

running (3m03.0s), 30/50 VUs, 114 complete and 0 interrupted iterations
ramp_up   [  61% ] 30/50 VUs  3m03.0s/5m00.0s

running (3m04.0s), 31/50 VUs, 114 complete and 0 interrupted iterations
ramp_up   [  61% ] 31/50 VUs  3m04.0s/5m00.0s

running (3m05.0s), 31/50 VUs, 115 complete and 0 interrupted iterations
ramp_up   [  62% ] 31/50 VUs  3m05.0s/5m00.0s

running (3m06.0s), 31/50 VUs, 116 complete and 0 interrupted iterations
ramp_up   [  62% ] 31/50 VUs  3m06.0s/5m00.0s

running (3m07.0s), 31/50 VUs, 117 complete and 0 interrupted iterations
ramp_up   [  62% ] 31/50 VUs  3m07.0s/5m00.0s

running (3m08.0s), 31/50 VUs, 118 complete and 0 interrupted iterations
ramp_up   [  63% ] 31/50 VUs  3m08.0s/5m00.0s

running (3m09.0s), 31/50 VUs, 118 complete and 0 interrupted iterations
ramp_up   [  63% ] 31/50 VUs  3m09.0s/5m00.0s

running (3m10.0s), 32/50 VUs, 119 complete and 0 interrupted iterations
ramp_up   [  63% ] 32/50 VUs  3m10.0s/5m00.0s

running (3m11.0s), 32/50 VUs, 120 complete and 0 interrupted iterations
ramp_up   [  64% ] 32/50 VUs  3m11.0s/5m00.0s

running (3m12.0s), 32/50 VUs, 121 complete and 0 interrupted iterations
ramp_up   [  64% ] 32/50 VUs  3m12.0s/5m00.0s

running (3m13.0s), 32/50 VUs, 122 complete and 0 interrupted iterations
ramp_up   [  64% ] 32/50 VUs  3m13.0s/5m00.0s

running (3m14.0s), 32/50 VUs, 123 complete and 0 interrupted iterations
ramp_up   [  65% ] 32/50 VUs  3m14.0s/5m00.0s

running (3m15.0s), 32/50 VUs, 126 complete and 0 interrupted iterations
ramp_up   [  65% ] 32/50 VUs  3m15.0s/5m00.0s

running (3m16.0s), 33/50 VUs, 127 complete and 0 interrupted iterations
ramp_up   [  65% ] 33/50 VUs  3m16.0s/5m00.0s

running (3m17.0s), 33/50 VUs, 129 complete and 0 interrupted iterations
ramp_up   [  66% ] 33/50 VUs  3m17.0s/5m00.0s

running (3m18.0s), 33/50 VUs, 130 complete and 0 interrupted iterations
ramp_up   [  66% ] 33/50 VUs  3m18.0s/5m00.0s

running (3m19.0s), 33/50 VUs, 131 complete and 0 interrupted iterations
ramp_up   [  66% ] 33/50 VUs  3m19.0s/5m00.0s

running (3m20.0s), 33/50 VUs, 132 complete and 0 interrupted iterations
ramp_up   [  67% ] 33/50 VUs  3m20.0s/5m00.0s

running (3m21.0s), 33/50 VUs, 134 complete and 0 interrupted iterations
ramp_up   [  67% ] 33/50 VUs  3m21.0s/5m00.0s

running (3m22.0s), 33/50 VUs, 135 complete and 0 interrupted iterations
ramp_up   [  67% ] 33/50 VUs  3m22.0s/5m00.0s

running (3m23.0s), 34/50 VUs, 136 complete and 0 interrupted iterations
ramp_up   [  68% ] 34/50 VUs  3m23.0s/5m00.0s

running (3m24.0s), 34/50 VUs, 138 complete and 0 interrupted iterations
ramp_up   [  68% ] 34/50 VUs  3m24.0s/5m00.0s

running (3m25.0s), 34/50 VUs, 140 complete and 0 interrupted iterations
ramp_up   [  68% ] 34/50 VUs  3m25.0s/5m00.0s

running (3m26.0s), 34/50 VUs, 142 complete and 0 interrupted iterations
ramp_up   [  69% ] 34/50 VUs  3m26.0s/5m00.0s

running (3m27.0s), 34/50 VUs, 144 complete and 0 interrupted iterations
ramp_up   [  69% ] 34/50 VUs  3m27.0s/5m00.0s

running (3m28.0s), 34/50 VUs, 145 complete and 0 interrupted iterations
ramp_up   [  69% ] 34/50 VUs  3m28.0s/5m00.0s

running (3m29.0s), 35/50 VUs, 147 complete and 0 interrupted iterations
ramp_up   [  70% ] 35/50 VUs  3m29.0s/5m00.0s

running (3m30.0s), 35/50 VUs, 148 complete and 0 interrupted iterations
ramp_up   [  70% ] 35/50 VUs  3m30.0s/5m00.0s

running (3m31.0s), 35/50 VUs, 149 complete and 0 interrupted iterations
ramp_up   [  70% ] 35/50 VUs  3m31.0s/5m00.0s

running (3m32.0s), 35/50 VUs, 153 complete and 0 interrupted iterations
ramp_up   [  71% ] 35/50 VUs  3m32.0s/5m00.0s

running (3m33.0s), 35/50 VUs, 153 complete and 0 interrupted iterations
ramp_up   [  71% ] 35/50 VUs  3m33.0s/5m00.0s

running (3m34.0s), 35/50 VUs, 154 complete and 0 interrupted iterations
ramp_up   [  71% ] 35/50 VUs  3m34.0s/5m00.0s

running (3m35.0s), 36/50 VUs, 155 complete and 0 interrupted iterations
ramp_up   [  72% ] 36/50 VUs  3m35.0s/5m00.0s

running (3m36.0s), 36/50 VUs, 155 complete and 0 interrupted iterations
ramp_up   [  72% ] 36/50 VUs  3m36.0s/5m00.0s

running (3m37.0s), 36/50 VUs, 156 complete and 0 interrupted iterations
ramp_up   [  72% ] 36/50 VUs  3m37.0s/5m00.0s

running (3m38.0s), 36/50 VUs, 156 complete and 0 interrupted iterations
ramp_up   [  73% ] 36/50 VUs  3m38.0s/5m00.0s

running (3m39.0s), 36/50 VUs, 157 complete and 0 interrupted iterations
ramp_up   [  73% ] 36/50 VUs  3m39.0s/5m00.0s

running (3m40.0s), 36/50 VUs, 158 complete and 0 interrupted iterations
ramp_up   [  73% ] 36/50 VUs  3m40.0s/5m00.0s

running (3m41.0s), 37/50 VUs, 158 complete and 0 interrupted iterations
ramp_up   [  74% ] 37/50 VUs  3m41.0s/5m00.0s

running (3m42.0s), 37/50 VUs, 159 complete and 0 interrupted iterations
ramp_up   [  74% ] 37/50 VUs  3m42.0s/5m00.0s

running (3m43.0s), 37/50 VUs, 160 complete and 0 interrupted iterations
ramp_up   [  74% ] 37/50 VUs  3m43.0s/5m00.0s

running (3m44.0s), 37/50 VUs, 161 complete and 0 interrupted iterations
ramp_up   [  75% ] 37/50 VUs  3m44.0s/5m00.0s

running (3m45.0s), 37/50 VUs, 162 complete and 0 interrupted iterations
ramp_up   [  75% ] 37/50 VUs  3m45.0s/5m00.0s

running (3m46.0s), 37/50 VUs, 163 complete and 0 interrupted iterations
ramp_up   [  75% ] 37/50 VUs  3m46.0s/5m00.0s

running (3m47.0s), 38/50 VUs, 163 complete and 0 interrupted iterations
ramp_up   [  76% ] 38/50 VUs  3m47.0s/5m00.0s

running (3m48.0s), 38/50 VUs, 164 complete and 0 interrupted iterations
ramp_up   [  76% ] 38/50 VUs  3m48.0s/5m00.0s

running (3m49.0s), 38/50 VUs, 165 complete and 0 interrupted iterations
ramp_up   [  76% ] 38/50 VUs  3m49.0s/5m00.0s

running (3m50.0s), 38/50 VUs, 165 complete and 0 interrupted iterations
ramp_up   [  77% ] 38/50 VUs  3m50.0s/5m00.0s

running (3m51.0s), 38/50 VUs, 166 complete and 0 interrupted iterations
ramp_up   [  77% ] 38/50 VUs  3m51.0s/5m00.0s

running (3m52.0s), 38/50 VUs, 166 complete and 0 interrupted iterations
ramp_up   [  77% ] 38/50 VUs  3m52.0s/5m00.0s

running (3m53.0s), 39/50 VUs, 167 complete and 0 interrupted iterations
ramp_up   [  78% ] 39/50 VUs  3m53.0s/5m00.0s

running (3m54.0s), 39/50 VUs, 167 complete and 0 interrupted iterations
ramp_up   [  78% ] 39/50 VUs  3m54.0s/5m00.0s

running (3m55.0s), 39/50 VUs, 168 complete and 0 interrupted iterations
ramp_up   [  78% ] 39/50 VUs  3m55.0s/5m00.0s

running (3m56.0s), 39/50 VUs, 169 complete and 0 interrupted iterations
ramp_up   [  79% ] 39/50 VUs  3m56.0s/5m00.0s

running (3m57.0s), 39/50 VUs, 170 complete and 0 interrupted iterations
ramp_up   [  79% ] 39/50 VUs  3m57.0s/5m00.0s

running (3m58.0s), 39/50 VUs, 172 complete and 0 interrupted iterations
ramp_up   [  79% ] 39/50 VUs  3m58.0s/5m00.0s

running (3m59.0s), 40/50 VUs, 173 complete and 0 interrupted iterations
ramp_up   [  80% ] 40/50 VUs  3m59.0s/5m00.0s

running (4m00.0s), 40/50 VUs, 173 complete and 0 interrupted iterations
ramp_up   [  80% ] 40/50 VUs  4m00.0s/5m00.0s

running (4m01.0s), 40/50 VUs, 175 complete and 0 interrupted iterations
ramp_up   [  80% ] 40/50 VUs  4m01.0s/5m00.0s

running (4m02.0s), 40/50 VUs, 176 complete and 0 interrupted iterations
ramp_up   [  81% ] 40/50 VUs  4m02.0s/5m00.0s

running (4m03.0s), 40/50 VUs, 176 complete and 0 interrupted iterations
ramp_up   [  81% ] 40/50 VUs  4m03.0s/5m00.0s

running (4m04.0s), 40/50 VUs, 177 complete and 0 interrupted iterations
ramp_up   [  81% ] 40/50 VUs  4m04.0s/5m00.0s

running (4m05.0s), 41/50 VUs, 178 complete and 0 interrupted iterations
ramp_up   [  82% ] 41/50 VUs  4m05.0s/5m00.0s

running (4m06.0s), 41/50 VUs, 178 complete and 0 interrupted iterations
ramp_up   [  82% ] 41/50 VUs  4m06.0s/5m00.0s

running (4m07.0s), 41/50 VUs, 180 complete and 0 interrupted iterations
ramp_up   [  82% ] 41/50 VUs  4m07.0s/5m00.0s

running (4m08.0s), 41/50 VUs, 181 complete and 0 interrupted iterations
ramp_up   [  83% ] 41/50 VUs  4m08.0s/5m00.0s

running (4m09.0s), 41/50 VUs, 182 complete and 0 interrupted iterations
ramp_up   [  83% ] 41/50 VUs  4m09.0s/5m00.0s

running (4m10.0s), 41/50 VUs, 183 complete and 0 interrupted iterations
ramp_up   [  83% ] 41/50 VUs  4m10.0s/5m00.0s

running (4m11.0s), 41/50 VUs, 183 complete and 0 interrupted iterations
ramp_up   [  84% ] 41/50 VUs  4m11.0s/5m00.0s

running (4m12.0s), 42/50 VUs, 185 complete and 0 interrupted iterations
ramp_up   [  84% ] 42/50 VUs  4m12.0s/5m00.0s

running (4m13.0s), 42/50 VUs, 186 complete and 0 interrupted iterations
ramp_up   [  84% ] 42/50 VUs  4m13.0s/5m00.0s

running (4m14.0s), 42/50 VUs, 187 complete and 0 interrupted iterations
ramp_up   [  85% ] 42/50 VUs  4m14.0s/5m00.0s

running (4m15.0s), 42/50 VUs, 188 complete and 0 interrupted iterations
ramp_up   [  85% ] 42/50 VUs  4m15.0s/5m00.0s

running (4m16.0s), 42/50 VUs, 189 complete and 0 interrupted iterations
ramp_up   [  85% ] 42/50 VUs  4m16.0s/5m00.0s

running (4m17.0s), 42/50 VUs, 190 complete and 0 interrupted iterations
ramp_up   [  86% ] 42/50 VUs  4m17.0s/5m00.0s

running (4m18.0s), 43/50 VUs, 191 complete and 0 interrupted iterations
ramp_up   [  86% ] 43/50 VUs  4m18.0s/5m00.0s

running (4m19.0s), 43/50 VUs, 191 complete and 0 interrupted iterations
ramp_up   [  86% ] 43/50 VUs  4m19.0s/5m00.0s

running (4m20.0s), 43/50 VUs, 192 complete and 0 interrupted iterations
ramp_up   [  87% ] 43/50 VUs  4m20.0s/5m00.0s

running (4m21.0s), 43/50 VUs, 193 complete and 0 interrupted iterations
ramp_up   [  87% ] 43/50 VUs  4m21.0s/5m00.0s

running (4m22.0s), 43/50 VUs, 193 complete and 0 interrupted iterations
ramp_up   [  87% ] 43/50 VUs  4m22.0s/5m00.0s

running (4m23.0s), 43/50 VUs, 194 complete and 0 interrupted iterations
ramp_up   [  88% ] 43/50 VUs  4m23.0s/5m00.0s

running (4m24.0s), 44/50 VUs, 194 complete and 0 interrupted iterations
ramp_up   [  88% ] 44/50 VUs  4m24.0s/5m00.0s

running (4m25.0s), 44/50 VUs, 196 complete and 0 interrupted iterations
ramp_up   [  88% ] 44/50 VUs  4m25.0s/5m00.0s

running (4m26.0s), 44/50 VUs, 197 complete and 0 interrupted iterations
ramp_up   [  89% ] 44/50 VUs  4m26.0s/5m00.0s

running (4m27.0s), 44/50 VUs, 198 complete and 0 interrupted iterations
ramp_up   [  89% ] 44/50 VUs  4m27.0s/5m00.0s

running (4m28.0s), 44/50 VUs, 199 complete and 0 interrupted iterations
ramp_up   [  89% ] 44/50 VUs  4m28.0s/5m00.0s

running (4m29.0s), 44/50 VUs, 199 complete and 0 interrupted iterations
ramp_up   [  90% ] 44/50 VUs  4m29.0s/5m00.0s

running (4m30.0s), 45/50 VUs, 200 complete and 0 interrupted iterations
ramp_up   [  90% ] 45/50 VUs  4m30.0s/5m00.0s

running (4m31.0s), 45/50 VUs, 200 complete and 0 interrupted iterations
ramp_up   [  90% ] 45/50 VUs  4m31.0s/5m00.0s

running (4m32.0s), 45/50 VUs, 201 complete and 0 interrupted iterations
ramp_up   [  91% ] 45/50 VUs  4m32.0s/5m00.0s

running (4m33.0s), 45/50 VUs, 202 complete and 0 interrupted iterations
ramp_up   [  91% ] 45/50 VUs  4m33.0s/5m00.0s

running (4m34.0s), 45/50 VUs, 203 complete and 0 interrupted iterations
ramp_up   [  91% ] 45/50 VUs  4m34.0s/5m00.0s

running (4m35.0s), 45/50 VUs, 203 complete and 0 interrupted iterations
ramp_up   [  92% ] 45/50 VUs  4m35.0s/5m00.0s

running (4m36.0s), 46/50 VUs, 204 complete and 0 interrupted iterations
ramp_up   [  92% ] 46/50 VUs  4m36.0s/5m00.0s

running (4m37.0s), 46/50 VUs, 205 complete and 0 interrupted iterations
ramp_up   [  92% ] 46/50 VUs  4m37.0s/5m00.0s

running (4m38.0s), 46/50 VUs, 205 complete and 0 interrupted iterations
ramp_up   [  93% ] 46/50 VUs  4m38.0s/5m00.0s

running (4m39.0s), 46/50 VUs, 205 complete and 0 interrupted iterations
ramp_up   [  93% ] 46/50 VUs  4m39.0s/5m00.0s

running (4m40.0s), 46/50 VUs, 206 complete and 0 interrupted iterations
ramp_up   [  93% ] 46/50 VUs  4m40.0s/5m00.0s

running (4m41.0s), 46/50 VUs, 208 complete and 0 interrupted iterations
ramp_up   [  94% ] 46/50 VUs  4m41.0s/5m00.0s

running (4m42.0s), 47/50 VUs, 209 complete and 0 interrupted iterations
ramp_up   [  94% ] 47/50 VUs  4m42.0s/5m00.0s

running (4m43.0s), 47/50 VUs, 210 complete and 0 interrupted iterations
ramp_up   [  94% ] 47/50 VUs  4m43.0s/5m00.0s

running (4m44.0s), 47/50 VUs, 210 complete and 0 interrupted iterations
ramp_up   [  95% ] 47/50 VUs  4m44.0s/5m00.0s

running (4m45.0s), 47/50 VUs, 211 complete and 0 interrupted iterations
ramp_up   [  95% ] 47/50 VUs  4m45.0s/5m00.0s

running (4m46.0s), 47/50 VUs, 213 complete and 0 interrupted iterations
ramp_up   [  95% ] 47/50 VUs  4m46.0s/5m00.0s

running (4m47.0s), 47/50 VUs, 214 complete and 0 interrupted iterations
ramp_up   [  96% ] 47/50 VUs  4m47.0s/5m00.0s

running (4m48.0s), 48/50 VUs, 215 complete and 0 interrupted iterations
ramp_up   [  96% ] 48/50 VUs  4m48.0s/5m00.0s

running (4m49.0s), 48/50 VUs, 215 complete and 0 interrupted iterations
ramp_up   [  96% ] 48/50 VUs  4m49.0s/5m00.0s

running (4m50.0s), 48/50 VUs, 216 complete and 0 interrupted iterations
ramp_up   [  97% ] 48/50 VUs  4m50.0s/5m00.0s

running (4m51.0s), 48/50 VUs, 217 complete and 0 interrupted iterations
ramp_up   [  97% ] 48/50 VUs  4m51.0s/5m00.0s

running (4m52.0s), 48/50 VUs, 217 complete and 0 interrupted iterations
ramp_up   [  97% ] 48/50 VUs  4m52.0s/5m00.0s

running (4m53.0s), 48/50 VUs, 219 complete and 0 interrupted iterations
ramp_up   [  98% ] 48/50 VUs  4m53.0s/5m00.0s

running (4m54.0s), 49/50 VUs, 220 complete and 0 interrupted iterations
ramp_up   [  98% ] 49/50 VUs  4m54.0s/5m00.0s

running (4m55.0s), 49/50 VUs, 221 complete and 0 interrupted iterations
ramp_up   [  98% ] 49/50 VUs  4m55.0s/5m00.0s

running (4m56.0s), 49/50 VUs, 221 complete and 0 interrupted iterations
ramp_up   [  99% ] 49/50 VUs  4m56.0s/5m00.0s

running (4m57.0s), 49/50 VUs, 223 complete and 0 interrupted iterations
ramp_up   [  99% ] 49/50 VUs  4m57.0s/5m00.0s

running (4m58.0s), 49/50 VUs, 223 complete and 0 interrupted iterations
ramp_up   [  99% ] 49/50 VUs  4m58.0s/5m00.0s

running (4m59.0s), 49/50 VUs, 224 complete and 0 interrupted iterations
ramp_up   [ 100% ] 49/50 VUs  4m59.0s/5m00.0s

running (5m00.0s), 49/50 VUs, 225 complete and 0 interrupted iterations
ramp_up   [ 100% ] 49/50 VUs  5m00.0s/5m00.0s

running (5m01.0s), 47/50 VUs, 227 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m02.0s), 46/50 VUs, 228 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m03.0s), 45/50 VUs, 229 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m04.0s), 44/50 VUs, 230 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m05.0s), 43/50 VUs, 231 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m06.0s), 43/50 VUs, 231 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m07.0s), 42/50 VUs, 232 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m08.0s), 41/50 VUs, 233 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m09.0s), 41/50 VUs, 233 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m10.0s), 39/50 VUs, 235 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m11.0s), 39/50 VUs, 235 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m12.0s), 39/50 VUs, 235 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m13.0s), 38/50 VUs, 236 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m14.0s), 38/50 VUs, 236 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m15.0s), 36/50 VUs, 238 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m16.0s), 36/50 VUs, 238 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m17.0s), 35/50 VUs, 239 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m18.0s), 33/50 VUs, 241 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m19.0s), 33/50 VUs, 241 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m20.0s), 31/50 VUs, 243 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m21.0s), 31/50 VUs, 243 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m22.0s), 31/50 VUs, 243 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m23.0s), 29/50 VUs, 245 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m24.0s), 28/50 VUs, 246 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m25.0s), 28/50 VUs, 246 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m26.0s), 27/50 VUs, 247 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m27.0s), 26/50 VUs, 248 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m28.0s), 26/50 VUs, 248 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m29.0s), 24/50 VUs, 250 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s

running (5m30.0s), 22/50 VUs, 252 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 49/50 VUs  5m0s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<2000' p(95)=24.47s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1288    3.902914/s
    checks_succeeded...: 100.00% 1288 out of 1288
    checks_failed......: 0.00%   0 out of 1288

    ✓ register succeeded
    ✓ login succeeded
    ✓ product created
    ✓ added to cart
    ✓ order placed

    HTTP
    http_req_duration..............: avg=6.24s  min=30.2ms med=78.34ms max=27.84s p(90)=21.99s p(95)=24.47s
      { expected_response:true }...: avg=6.24s  min=30.2ms med=78.34ms max=27.84s p(90)=21.99s p(95)=24.47s
    http_req_failed................: 0.00%  0 out of 1288
    http_reqs......................: 1288   3.902914/s

    EXECUTION
    iteration_duration.............: avg=30.46s min=2.06s  med=32.97s  max=53.58s p(90)=49.1s  p(95)=51.98s
    iterations.....................: 252    0.763614/s
    vus............................: 22     min=1         max=49
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 397 kB 1.2 kB/s
    data_sent......................: 626 kB 1.9 kB/s



running (5m30.0s), 00/50 VUs, 252 complete and 22 interrupted iterations
ramp_up ✓ [ 100% ] 22/50 VUs  5m0s
time="2026-08-09T14:30:03+01:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"